Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/prisoners_rights.html.txt.tmx
Source language: en
Languages: ga

source: The Constitution recognises and declares that people living in Ireland have certain fundamental personal rights
ga: Aithnítear agus fógraítear sa Bhunreacht go bhfuil cearta bunúsacha pearsanta áirithe ag daoine a chónaíonn in Éirinn

source: These rights may be derived or implied from the Constitution
ga: D’fhéadfaí na cearta seo a dhíorthú nó a chur in iúl ón mBunreacht

source: The Courts decide what the Constitution means
ga: Déanann na Cúirteanna cinneadh air sin a bhíonn i gceist sa Bhunreacht

source: Fundamental rights are not absolute – they can be limited or restricted by the Oireachtas on the grounds, for example, of the common good
ga: Níl cearta bunúsacha dearbh – is féidir leis an Oireachtas iad a theorannú nó a chosc ar bhunúis an leasa choitinn, mar shampla

source: Ireland has agreed to follow the terms of 4 international treaties which lay out standards for the treatment of prisoners
ga: Chomhaontaigh Éire chun cloí le téarmaí 4 chonradh idirnáisiúnta ina leagtar amach na caighdeáin chun caitheamh le príosúnaigh

source: • European Convention on Human Rights (ECHR)
ga: • An Coinbhinsiún Eorpach um Charta an Duine (ECHR)

source: • European Convention for the Prevention of Torture and Inhuman or Degrading Treatment or Punishment
ga: • An Coinbhinsiún Eorpach maidir le Cosc ar Chéasadh agus ar Íde agus ar Phionós ata Mídhaonna nó Táireach

source: • International Covenant on Civil and Political Rights (ICCPR)
ga: • Cúnant Idirnáisiúnta ar Chearta Sibhialta agus Polaitiúla (ICCPR)

source: • Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (CAT)
ga: • An Coinbhsiún i gcoinne Céasadh agus i gcoinne Íde nó Pionós EEIle atá Cruálach, Mídhaonna nó Táireach (CAT)

source: There is also the Council of Europe’s European Prison Rules which give guidance on standards for prisons
ga: Anuas air sin, tá Rialacha Príosúin na hEorpa de chuid Chomhairle na hEorpa ann ina dtugtar treoir maidir le caighdeáin do phríosúin

source: The main source of prisoners’ rights is the Prison Rules 2007 as amended
ga: Is í príomhfhoinse cearta príosúnach Rialacha na bPríosún, 2007 arna leasú

source: The following is an overview of how prison affects the daily life and associated rights of an individual
ga: Seo a leanas forbhreathnú ar conas a imríonn an príosún tionchar ar shaol laethúil agus ar chearta gaolmhara duine aonair

source: The courts have not yet decided that you have a right to marry while you are in prison
ga: Ní dhearna na cúirteanna an cinneadh go fóill go bhfuil an ceart chun pósta agat fad atá tú i bpríosún

source: Right to procreate and/or conjugal rights
ga: An ceart chun tuismithe agus/nó cearta comhchuingithe

source: You do not have a right to temporary release or conjugal visits
ga: Níl an ceart agat go scaoilfear go sealadach thú nó go dtugtar cuairteanna comhchuingithe ort

source: If you are married, you have a right to communicate with your spouse, but without privacy
ga: Má tá tú pósta, tá an ceart agat cumarsáid a dhéanamh le do chéile, ach gan phríobháideacht a bheith agaibh

source: You also have a right to take some part in the education of your children
ga: Anuas air sin, tá an ceart agat chun páirt áirithe a ghlacadh in oideachas do leanaí

source: You have a right to be registered in the political constituency where you would normally live if you were not in prison
ga: Tá an ceart agat a bheith cláraithe sa toghcheantar polaitiúil a mbeadh gnáthchónaí ort ann mura mbeifeá i bpríosún

source: However, you have no right to be given physical access to a ballot box by temporary release
ga: Níl aon cheart agat, áfach, rochtain fhisiciúil a fháil ar bhosca ballóide trí scaoileadh sealadach

source: If you happen to be on parole or temporary release at the time of an election, you are free to vote where you are registered
ga: Má tharlaíonn go mbíonn tú ar parúil nó ar scaoileadh sealadach ag tráth toghcháin, is féidir leat vóta a chaitheamh san áit a bhfuil tú cláraithe

source: Your rights if you are on remand are the same as if you were a convicted prisoner
ga: Is ionann do chuid ceart má tá tú ar athchur agus más príosúnach ciontaithe thú

source: The Electoral (Amendment) Act 2006 provides procedures that enable prisoners to vote by post
ga: Soláthraítear nósanna imeachta san Acht Toghcháin (Leasú), 2006 a chuireann ar chumas príosúnach chun vóta a chaitheamh sa phost

source: If you are in prison, you can register for a postal vote in the area that you would otherwise be living in
ga: Má tá tú i bpríosún, féadfaidh tú clárú do vóta poist sa cheantar ina mbeifeá i do chónaí mura raibh tú i bpríosún

source: If you are already registered to vote in that area and wish to be able to vote from prison then you should fill out a form called Form RFG
ga: Má tá tú cláraithe le vóta a chaitheamh cheana féin sa cheantar sin agus más mian leat bheith in ann vóta a chaitheamh ón bpríosún, ba cheart duit foirm ar a dtugtar Foirm RFG a chomhlánú

source: If you are not already on the register then you should complete Form RFA4 as well
ga: Mura bhfuil tú ar an gclár cheana féin, ba cheart duit Foirm RFA4 a chomhlánú chomh maith

source: These application forms are available in all prisons and should be sent to the local authority for your area
ga: Tá na foirmeacha iarratais seo ar fáil i ngach príosún agus ba cheart iad a sheoladh chuig an údarás áitiúil i do cheantar

source: You have a right to communicate with other prisoners while you are working or at recreation
ga: Tá sé de cheart agat caidreamh a dhéanamh le príosúnaigh eile fad atá tú ag oibriú nó i mbun caitheamh aimsire

source: However, you must communicate in an orderly way and you cannot impede the other prisoners' work
ga: Ní mór duit cumarsáid a dhéanamh ar bhealach ordúil, áfach, agus ní féidir leat srian a chur ar obair na bpríosúnach

source: The governor of the prison can take away this right in the interest of good order in the prison
ga: Is féidir le gobharnóir an phríosúin an ceart seo a bhaint díot ar mhaithe dea-ord sa phríosún

source: You have a limited right to privacy
ga: Tá ceart teoranta chun príobháideachta agat

source: For example, you may not to be stripped, searched or bathed in the presence of another prisoner
ga: Mar shampla, ní féidir thú a nochtadh, a chuardach nó a fholcadh i láthair príosúnaigh eile

source: In addition, you have the right to be exposed to the public view as little as possible while being removed from or to prison
ga: Anuas air sin, tá an ceart agat go nochtfar thú a laghad don phobal fad atá tú á aistriú isteach nó amach ó bpríosún

source: However, you may be photographed
ga: Mar sin féin, féadtar grianghraif a ghlacadh díot

source: Your right to privacy may be limited for security reasons
ga: D’fhéadfadh do cheart chun príobháideachta a bheith teoranta mar gheall ar chúiseanna slándála

source: Rights relating to searches and drug testing
ga: Cearta maidir le cuardaigh agus tástáil drugaí

source: You may be searched and you may only be searched by officers of the same sex
ga: Is féidir thú a chuardach agus ní féidir ach le hoifigigh den ghnéas céanna thú a chuardach

source: The search must be done with due regard to your decency and self-respect and in as appropriate a manner as possible
ga: Ní mór an cuardach a dhéanamh agus an aird cheart á tabhairt ar do gheanas agus d’fhéinmheas agus ar an mbealach is oiriúnaí agus is féidir

source: At no stage should you be left completely naked
ga: Níor cheart thú a fhágáil go hiomlán nocht ag aon tráth

source: You might have to give a hair, urine or saliva sample for the purpose of detecting the presence or use of alcohol, a controlled drug or a medicinal product
ga: B’fhéidir go mbeidh ort sampla gruaige, fuail nó seile a thabhairt ar mhaithe le láithreacht nó úsáid alcóil, druga rialaithe nó táirge leighis a bhrath

source: A search can only be carried out for a genuine purpose, for example, to find forbidden items
ga: Ní féidir cuardach a dhéanamh mura bhfuil fíorchúis leis, mar shampla, chun cuardach a dhéanamh ar ábhair nach bhfuil ceadaithe

source: A search cannot be carried out simply to harass you
ga: Ní féidir thú a chuardach díreach ar mhaithe le thú a chiapadh

source: Right to freedom from discrimination
ga: An ceart chun saoirse ó idirdhealú

source: You have the same right to freedom from discrimination as any other citizen
ga: Tá an ceart céanna agat chun saoirse ó idirdhealú atá ag aon saoránach eile

source: If you are involved in indoor work at the prison, you are entitled to daily exercise in the open air for one hour or more
ga: Má ghlacann tú páirt in obair taobh istigh ag an bpríosún, tá tú i dteideal tabhairt faoi aclaíocht laethúil faoin aer ar feadh uair an chloig nó níos mó

source: Where possible, you must be provided with access to indoor space and equipment, suitable for physical recreation, exercise or training
ga: Sa chás gur féidir, ní mór rochtain a sholáthar duit ar spás agus trealamh taobh istigh, atá oiriúnach le haghaidh caitheamh aimsire, aclaíocht nó oiliúint fhisiciúil

source: You do not have the right to keep money in prison
ga: Níl an ceart agat chun airgead a choimeád i bpríosún

source: You are not allowed to keep all the money and effects you brought into the prison or were sent to the prison for your use
ga: Ní cheadaítear duit an t-airgead agus na hearraí go léir a choimeád a thug tú leat isteach sa phríosún nó a seoladh chuig an bpríosún go mbainfidh tú úsáid astu

source: They will be placed in the custody of the governor, who will keep an inventory of them
ga: Coimeádfar iad faoi choimeád an ghobharnóra, a choimeádfaidh fardal díobh

source: The money will be lodged into an account for your use
ga: Cuirfear an t-airgead i dtaisce i gcuntas a mbeidh tú in ann úsáid a bhaint as

source: Right to bodily integrity
ga: An ceart chun corpiomláine

source: You have a limited right to bodily integrity
ga: Tá ceart teoranta chun corpiomláine agat

source: For example, a prisoner's hair cannot be cut without their consent unless the prison doctor considers it necessary on health grounds
ga: Mar shampla, ní féidir gruaig phríosúnaigh a ghearradh mura dtugann siad toiliú, mura measann dochtúir an phríosúin go bhfuil gá léis ar bhunúis sláinte

source: Right to earn a livelihood
ga: An ceart chun slí mhaireachtála a thuilleamh

source: You do not have a right to run a business or earn a livelihood from prison
ga: Níl an ceart agat chun gnólacht a reáchtáil nó chun slí mhaireachtála a thuilleamh ón bpríosún

source: Right to freedom of religion
ga: An ceart chun saoirse reiligiúin

source: You do have a right to practise your religion
ga: Tá an ceart agat chun do reiligiún féin a chleachtadh

source: The prison will provide for basic religious needs but you do not have a right to special requirements
ga: Freastalóidh an príosún ar riachtanais bhunúsacha reiligiúnacha ach níl an ceart agat riachtanais speisialta a fháil

source: When you arrive in prison, you will state your religious denomination and if there is no service provided in the prison for your denomination, the prison will allow a religious instructor visit you
ga: Nuair a théann tú isteach i bpríosún, luafaidh tú do shainchreideamh agus mura bhfuil aon seirbhís ar fáil do do shainchreideamh, ceadóidh an príosún go dtabharfaidh teagascóir reiligiúnach cuairt ort

source: While you are in prison, you must be given a healthy, well balanced and reasonably varied diet
ga: Fad atá tú i bpríosún, ní mór go dtabharfar cothú sláintiúil, dea-chothromaithe agus réasúnta éagsúil duit

source: Where possible, provision is made to enable a prisoner to observe the dietary practices of their religion or culture
ga: Sa chás gur féidir, déantar foráil lena chur ar chumas príosúnaigh chun cloí le cleachtais chothaithe a reiligiúin nó a gcultúir

source: The prison medical officer can approve a change of diet
ga: Is féidir le hoifigeach leighis an phríosúin athrú cothaithe a fhaomhadh

source: You have a right to education while you are in prison
ga: Tá ceart chun oideachais agat fad a bhíonn tú i bpríosún

source: The child of a female prisoner can be taken into the prison to facilitate breast feeding, until the child is 12 months of age
ga: Is féidir leanbh príosúnaigh bhaininn a thabhairt isteach sa phríosún chun cothú cíche a éascú, go dtí mbaineann an leanbh 12 mhí d’aois amach

source: The child may not be taken from its mother until the medical officer certifies that it is in a fit condition to be removed
ga: Ní féidir an leanbh a thógáil ón máthair go dtí go ndeimhníonn an t-oifigeach leighis go bhfuil an bhail cheart ar an leanbh agus gur féidir é/í a bhaint den mháthair

source: Except in special circumstances, the child will not be kept in the prison after it is 12 months old
ga: Seachas faoi chúinsí speisialta, ní choimeádfar an leanbh sa phríosún i ndiaidh gur bhain sé/sí 12 mhí d’aois amach

source: Before taking a child out of prison, the governor must consult with the child’s mother and the Child and Family Agency as to the appropriate placement for the child
ga: Sula nglactar leanbh amach ó phríosún, ní mór don ghobharnóir dul i gcomhairle le máthair an linbh agus leis an nGníomhaireacht um Leanaí agus an Teaghlach maidir leis an socrúchán cuí don leanbh

source: Prisoners do not have a right to smoke except in accordance with rules laid down by the governor
ga: Níl an ceart ag príosúnaigh chun tobac a chaitheamh seachas i gcomhréir leis na rialacha a leagann an gobharnóir síos

source: You can find further information on prisoners' rights in the publication, Know Your Rights: Your Rights as a Prisoner produced jointly by the Irish Council for Civil Liberties and the Irish Penal Reform Trust
ga: Féadfaidh tú teacht ar bhreis faisnéise ar chearta príosúnach sna foilseacháin a leanas: Bíodh Eolas Agat ar do Chearta: Do Chuid Ceart mar Phríosúnach ar chuir Comhairle na hÉireann um Shaoirsí Sibhialta agus Iontaobhas na hÉireann um Athchóiriú an Chórais Choiriúil i dtoll a chéile
